In [1]:
import pandas as pd
import sqlite3

In [2]:
df = pd.read_csv('./raw/dataset.csv')

df

,Produto,Preço,Pgto.,Nº Parcelas,Data,Cliente,E-mail,DDD,Telefone
0,Produto B,R$ 1200,Boleto Bancário,9,25/09/2018,Tércio Silva,térciosilva@hotmail.com,97,910364899
1,Produto C,R$ 500,Boleto Bancário,3,10/12/2018,Danubia Pereira,danubiapereira@outlook.com,88,942481614
2,Produto C,R$ 750,Cartão de Crédito,5,29/12/2018,Tamires Souza,tamiressouza@gmail.com,88,910977822
3,Produto C,R$ 1000,Pix,7,03/05/2018,Danubia Santos,danubiasantos@outlook.com,65,972923801
4,Produto C,R$ 500,Cartão de Crédito,9,03/01/2018,Danubia Almeida,danubiaalmeida@hotmail.com,91,975629460
...,...,...,...,...,...,...,...,...,...
4995,Produto B,R$ 500,Pix,8,29/07/2018,Presley Santos,presleysantos@outlook.com,21,937357329
4996,Produto B,R$ 750,Boleto Bancário,2,17/11/2018,Jonatas Santos,jonatassantos@hotmail.com,41,909337604
4997,Produto C,R$ 500,Pix,2,25/09/2018,Alefy Martins,alefymartins@hotmail.com,15,926175735
4998,Produto C,R$ 500,Pix,5,24/01/2018,Lucas Silva,lucassilva@hotmail.com,68,932229880
4999,Produto A,R$ 750,Pix,11,12/05/2018,Danubia Souza,danubiasouza@hotmail.com,14,949965288

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Produto      5000 non-null   object
 1   Preço        5000 non-null   object
 2   Pgto.        5000 non-null   object
 3   Nº Parcelas  5000 non-null   int64
 4   Data         5000 non-null   object
 5   Cliente      5000 non-null   object
 6   E-mail       5000 non-null   object
 7   DDD          5000 non-null   int64
 8   Telefone     5000 non-null   int64
dtypes: int64(3), object(6)
memory usage: 351.7+ KB

In [4]:
df = df.rename(columns={
    "Produto": "produto",
    "Preço": "preco",
    "Pgto.": "forma_pagamento",
    "Nº Parcelas": "num_parcelas",
    "Data": "data",
    "Cliente": "cliente",
    "E-mail": "email",
    "DDD": "ddd",
    "Telefone": "telefone"
})

df

,produto,preco,forma_pagamento,num_parcelas,data,cliente,email,ddd,telefone
0,Produto B,R$ 1200,Boleto Bancário,9,25/09/2018,Tércio Silva,térciosilva@hotmail.com,97,910364899
1,Produto C,R$ 500,Boleto Bancário,3,10/12/2018,Danubia Pereira,danubiapereira@outlook.com,88,942481614
2,Produto C,R$ 750,Cartão de Crédito,5,29/12/2018,Tamires Souza,tamiressouza@gmail.com,88,910977822
3,Produto C,R$ 1000,Pix,7,03/05/2018,Danubia Santos,danubiasantos@outlook.com,65,972923801
4,Produto C,R$ 500,Cartão de Crédito,9,03/01/2018,Danubia Almeida,danubiaalmeida@hotmail.com,91,975629460
...,...,...,...,...,...,...,...,...,...
4995,Produto B,R$ 500,Pix,8,29/07/2018,Presley Santos,presleysantos@outlook.com,21,937357329
4996,Produto B,R$ 750,Boleto Bancário,2,17/11/2018,Jonatas Santos,jonatassantos@hotmail.com,41,909337604
4997,Produto C,R$ 500,Pix,2,25/09/2018,Alefy Martins,alefymartins@hotmail.com,15,926175735
4998,Produto C,R$ 500,Pix,5,24/01/2018,Lucas Silva,lucassilva@hotmail.com,68,932229880
4999,Produto A,R$ 750,Pix,11,12/05/2018,Danubia Souza,danubiasouza@hotmail.com,14,949965288

### Dimensões

In [5]:
dim_cliente = (
    df[["cliente", "email", "ddd", "telefone"]]
    .drop_duplicates()
    .reset_index(drop=True)
)
dim_cliente["id_cliente"] = dim_cliente.index + 1
dim_cliente = dim_cliente[["id_cliente", "cliente", "email", "ddd", "telefone"]]

In [6]:
dim_cliente

      id_cliente          cliente                       email  ddd   telefone
0              1     Tércio Silva     térciosilva@hotmail.com   97  910364899
1              2  Danubia Pereira  danubiapereira@outlook.com   88  942481614
2              3    Tamires Souza      tamiressouza@gmail.com   88  910977822
3              4   Danubia Santos   danubiasantos@outlook.com   65  972923801
4              5  Danubia Almeida  danubiaalmeida@hotmail.com   91  975629460
...          ...              ...                         ...  ...        ...
4995        4996   Presley Santos   presleysantos@outlook.com   21  937357329
4996        4997   Jonatas Santos   jonatassantos@hotmail.com   41  909337604
4997        4998    Alefy Martins    alefymartins@hotmail.com   15  926175735
4998        4999      Lucas Silva      lucassilva@hotmail.com   68  932229880
4999        5000    Danubia Souza    danubiasouza@hotmail.com   14  949965288

[5000 rows x 5 columns]

In [7]:
len(dim_cliente)

5000

In [9]:
dim_cliente

      id_cliente          cliente                       email  ddd   telefone
0              1     Tércio Silva     térciosilva@hotmail.com   97  910364899
1              2  Danubia Pereira  danubiapereira@outlook.com   88  942481614
2              3    Tamires Souza      tamiressouza@gmail.com   88  910977822
3              4   Danubia Santos   danubiasantos@outlook.com   65  972923801
4              5  Danubia Almeida  danubiaalmeida@hotmail.com   91  975629460
...          ...              ...                         ...  ...        ...
4995        4996   Presley Santos   presleysantos@outlook.com   21  937357329
4996        4997   Jonatas Santos   jonatassantos@hotmail.com   41  909337604
4997        4998    Alefy Martins    alefymartins@hotmail.com   15  926175735
4998        4999      Lucas Silva      lucassilva@hotmail.com   68  932229880
4999        5000    Danubia Souza    danubiasouza@hotmail.com   14  949965288

[5000 rows x 5 columns]

In [10]:
dim_produto = (
    df[["produto"]]
    .drop_duplicates()
    .reset_index(drop=True)
)
dim_produto["id_produto"] = dim_produto.index + 1
dim_produto = dim_produto[["id_produto", "produto"]]

In [11]:
dim_produto

   id_produto    produto
0           1  Produto B
1           2  Produto C
2           3  Produto A

In [12]:
dim_pagamento = (
    df[["forma_pagamento", "num_parcelas"]]
    .drop_duplicates()
    .reset_index(drop=True)
)
dim_pagamento["id_pagamento"] = dim_pagamento.index + 1
dim_pagamento = dim_pagamento[["id_pagamento", "forma_pagamento", "num_parcelas"]]

In [13]:
dim_pagamento

    id_pagamento    forma_pagamento  num_parcelas
0              1    Boleto Bancário             9
1              2    Boleto Bancário             3
2              3  Cartão de Crédito             5
3              4                Pix             7
4              5  Cartão de Crédito             9
5              6  Cartão de Crédito            12
6              7  Cartão de Crédito             3
7              8                Pix             6
8              9    Boleto Bancário             5
9             10    Boleto Bancário             1
10            11    Boleto Bancário            11
11            12                Pix             3
12            13                Pix             9
13            14                Pix            12
14            15    Boleto Bancário             7
15            16  Cartão de Crédito             8
16            17    Boleto Bancário             8
17            18                Pix             8
18            19                Pix            10
19            20  Cartão de Crédito             6
20            21  Cartão de Crédito             4
21            22    Boleto Bancário            10
22            23                Pix             4
23            24  Cartão de Crédito             7
24            25    Boleto Bancário             6
25            26    Boleto Bancário             2
26            27                Pix             5
27            28  Cartão de Crédito            11
28            29                Pix            11
29            30                Pix             1
30            31  Cartão de Crédito             2
31            32    Boleto Bancário            12
32            33    Boleto Bancário             4
33            34                Pix             2
34            35  Cartão de Crédito            10
35            36  Cartão de Crédito             1

In [14]:
dim_tempo = (
    df[["data"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

In [15]:
dim_tempo['data'] = pd.to_datetime(dim_tempo['data'])

dim_tempo['ano'] = dim_tempo['data'].dt.year
dim_tempo['mes'] = dim_tempo['data'].dt.month
dim_tempo['dia'] = dim_tempo['data'].dt.day

C:\Users\foxgh\AppData\Local\Temp\ipykernel_16104\1304810004.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  dim_tempo['data'] = pd.to_datetime(dim_tempo['data'])

In [16]:
dim_tempo

          data   ano  mes  dia
0   2018-09-25  2018    9   25
1   2018-12-10  2018   12   10
2   2018-12-29  2018   12   29
3   2018-05-03  2018    5    3
4   2018-01-03  2018    1    3
..         ...   ...  ...  ...
361 2018-11-26  2018   11   26
362 2018-08-31  2018    8   31
363 2018-04-26  2018    4   26
364 2018-04-20  2018    4   20
365 2018-12-27  2018   12   27

[366 rows x 4 columns]

In [17]:
dim_tempo = (
    df[["data"]]
    .drop_duplicates()
    .assign(
        data=lambda x: pd.to_datetime(x["data"]),
    )
    .reset_index(drop=True)
)
dim_tempo["id_data"] = dim_tempo["data"].dt.strftime("%Y%m%d").astype(int)
dim_tempo["ano"] = dim_tempo["data"].dt.year
dim_tempo["mes"] = dim_tempo["data"].dt.month
dim_tempo["dia"] = dim_tempo["data"].dt.day

dim_tempo = dim_tempo[["id_data", "data", "ano", "mes", "dia"]]

C:\Users\foxgh\AppData\Local\Temp\ipykernel_16104\193901030.py:5: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  data=lambda x: pd.to_datetime(x["data"]),

In [18]:
dim_tempo

      id_data       data   ano  mes  dia
0    20180925 2018-09-25  2018    9   25
1    20181210 2018-12-10  2018   12   10
2    20181229 2018-12-29  2018   12   29
3    20180503 2018-05-03  2018    5    3
4    20180103 2018-01-03  2018    1    3
..        ...        ...   ...  ...  ...
361  20181126 2018-11-26  2018   11   26
362  20180831 2018-08-31  2018    8   31
363  20180426 2018-04-26  2018    4   26
364  20180420 2018-04-20  2018    4   20
365  20181227 2018-12-27  2018   12   27

[366 rows x 5 columns]

In [19]:
df["data"] = pd.to_datetime(df["data"], dayfirst=True)
dim_tempo["data"] = pd.to_datetime(dim_tempo["data"])

In [20]:
print("df columns:", df.columns.tolist())
print("dim_tempo columns:", dim_tempo.columns.tolist())

df columns: ['produto', 'preco', 'forma_pagamento', 'num_parcelas', 'data', 'cliente', 'email', 'ddd', 'telefone']
dim_tempo columns: ['id_data', 'data', 'ano', 'mes', 'dia']

In [21]:

fato = (
    df
    .merge(dim_cliente, on=["cliente", "email", "ddd", "telefone"], how="left")
    .merge(dim_produto, on=["produto"], how="left")
    .merge(dim_pagamento, on=["forma_pagamento", "num_parcelas"], how="left")
    .merge(dim_tempo, on=["data"], how="left")  # join por data
)

In [22]:
fato

,produto,preco,forma_pagamento,num_parcelas,data,cliente,email,ddd,telefone,id_cliente,id_produto,id_pagamento,id_data,ano,mes,dia
0,Produto B,R$ 1200,Boleto Bancário,9,2018-09-25,Tércio Silva,térciosilva@hotmail.com,97,910364899,1,1,1,20180925,2018,9,25
1,Produto C,R$ 500,Boleto Bancário,3,2018-12-10,Danubia Pereira,danubiapereira@outlook.com,88,942481614,2,2,2,20181210,2018,12,10
2,Produto C,R$ 750,Cartão de Crédito,5,2018-12-29,Tamires Souza,tamiressouza@gmail.com,88,910977822,3,2,3,20181229,2018,12,29
3,Produto C,R$ 1000,Pix,7,2018-05-03,Danubia Santos,danubiasantos@outlook.com,65,972923801,4,2,4,20180503,2018,5,3
4,Produto C,R$ 500,Cartão de Crédito,9,2018-01-03,Danubia Almeida,danubiaalmeida@hotmail.com,91,975629460,5,2,5,20180103,2018,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,Produto B,R$ 500,Pix,8,2018-07-29,Presley Santos,presleysantos@outlook.com,21,937357329,4996,1,18,20180729,2018,7,29
4996,Produto B,R$ 750,Boleto Bancário,2,2018-11-17,Jonatas Santos,jonatassantos@hotmail.com,41,909337604,4997,1,26,20181117,2018,11,17
4997,Produto C,R$ 500,Pix,2,2018-09-25,Alefy Martins,alefymartins@hotmail.com,15,926175735,4998,2,34,20180925,2018,9,25
4998,Produto C,R$ 500,Pix,5,2018-01-24,Lucas Silva,lucassilva@hotmail.com,68,932229880,4999,2,27,20180124,2018,1,24
4999,Produto A,R$ 750,Pix,11,2018-05-12,Danubia Souza,danubiasouza@hotmail.com,14,949965288,5000,3,29,20180512,2018,5,12

In [23]:
fato = fato[['produto', 'preco', 'forma_pagamento',	'num_parcelas', 'data', 'cliente', 'email',	'ddd', 'telefone', 'id_cliente', 'id_produto', 'id_pagamento', 'id_data']]

In [24]:
fato.head()

,produto,preco,forma_pagamento,num_parcelas,data,cliente,email,ddd,telefone,id_cliente,id_produto,id_pagamento,id_data
0,Produto B,R$ 1200,Boleto Bancário,9,2018-09-25,Tércio Silva,térciosilva@hotmail.com,97,910364899,1,1,1,20180925
1,Produto C,R$ 500,Boleto Bancário,3,2018-12-10,Danubia Pereira,danubiapereira@outlook.com,88,942481614,2,2,2,20181210
2,Produto C,R$ 750,Cartão de Crédito,5,2018-12-29,Tamires Souza,tamiressouza@gmail.com,88,910977822,3,2,3,20181229
3,Produto C,R$ 1000,Pix,7,2018-05-03,Danubia Santos,danubiasantos@outlook.com,65,972923801,4,2,4,20180503
4,Produto C,R$ 500,Cartão de Crédito,9,2018-01-03,Danubia Almeida,danubiaalmeida@hotmail.com,91,975629460,5,2,5,20180103

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   produto          5000 non-null   object
 1   preco            5000 non-null   object
 2   forma_pagamento  5000 non-null   object
 3   num_parcelas     5000 non-null   int64
 4   data             5000 non-null   datetime64[ns]
 5   cliente          5000 non-null   object
 6   email            5000 non-null   object
 7   ddd              5000 non-null   int64
 8   telefone         5000 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(5)
memory usage: 351.7+ KB

In [26]:
fato.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   produto          5000 non-null   object
 1   preco            5000 non-null   object
 2   forma_pagamento  5000 non-null   object
 3   num_parcelas     5000 non-null   int64
 4   data             5000 non-null   datetime64[ns]
 5   cliente          5000 non-null   object
 6   email            5000 non-null   object
 7   ddd              5000 non-null   int64
 8   telefone         5000 non-null   int64
 9   id_cliente       5000 non-null   int64
 10  id_produto       5000 non-null   int64
 11  id_pagamento     5000 non-null   int64
 12  id_data          5000 non-null   int64
dtypes: datetime64[ns](1), int64(7), object(5)
memory usage: 507.9+ KB

In [27]:
fato_vendas = fato[['id_cliente', 'id_produto', 'id_pagamento', 'id_data', 'data', 'preco']]

fato_vendas.insert(0, 'id_venda', range(1, len(fato_vendas)+1))

In [28]:
fato_vendas.head()

,id_venda,id_cliente,id_produto,id_pagamento,id_data,data,preco
0,1,1,1,1,20180925,2018-09-25,R$ 1200
1,2,2,2,2,20181210,2018-12-10,R$ 500
2,3,3,2,3,20181229,2018-12-29,R$ 750
3,4,4,2,4,20180503,2018-05-03,R$ 1000
4,5,5,2,5,20180103,2018-01-03,R$ 500

## Criando conexão com SQLite (Banco de Dados)

In [29]:
db_name = 'dw_vendas.db'
conn = sqlite3.connect(db_name)
cur = conn.cursor()

In [30]:
cur.execute('PRAGMA foreign_keys = ONç')

In [31]:
schema_sql = """
DROP TABLE IF EXISTS fato_vendas;
DROP TABLE IF EXISTS dim_cliente;
DROP TABLE IF EXISTS dim_produto;
DROP TABLE IF EXISTS dim_pagamento;
DROP TABLE IF EXISTS dim_tempo;

-- DIM CLIENTE
CREATE TABLE dim_cliente(
    id_cliente INTEGER PRIMARY KEY,
    cliente TEXT NOT NULL,
    email TEXT,
    ddd TEXT,
    telefone TEXT
);

-- DIM PRODUTO
CREATE TABLE dim_produto(
    id_produto INTEGER PRIMARY KEY,
    produto TEXT NOT NULL
);

-- DIM PAGAMENTO
CREATE TABLE dim_pagamento(
    id_pagamento INTEGER PRIMARY KEY,
    forma_pagamento TEXT NOT NULL,
    num_parcelas INTEGER NOT NULL
);

-- DIM TEMPO
CREATE TABLE dim_tempo(
    id_data INTEGER PRIMARY KEY,
    data DATE NOT NULL,
    ano INTEGER,
    mes INTEGER,
    dia INTEGER
);

-- FATO VENDAS
CREATE TABLE fato_vendas(
    id_venda INTEGER PRIMARY KEY,
    id_cliente INTEGER NOT NULL,
    id_produto INTEGER NOT NULL,
    id_pagamento INTEGER NOT NULL,
    id_data INTEGER NOT NULL,
    preco REAL NOT NULL,

    FOREIGN KEY (id_cliente) REFERENCES dim_cliente(id_cliente),
    FOREIGN KEY (id_produto) REFERENCES dim_produto(id_produto),
    FOREIGN KEY (id_pagamento) REFERENCES dim_pagamento(id_pagamento),
    FOREIGN KEY (id_data) REFERENCES dim_tempo(id_data)
);
"""

In [32]:
cur = conn.cursor()
cur.executescript(schema_sql)
conn.commit()

In [33]:
dim_cliente.to_sql("dim_cliente", conn, if_exists="append", index=False)
dim_produto.to_sql("dim_produto", conn, if_exists="append", index=False)
dim_pagamento.to_sql("dim_pagamento", conn, if_exists="append", index=False)
dim_tempo.to_sql("dim_tempo", conn, if_exists="append", index=False)

366

In [34]:
fato_vendas = (
    df
    .merge(dim_cliente, on=["cliente", "email", "ddd", "telefone"], how="left")
    .merge(dim_produto, on=["produto"], how="left")
    .merge(dim_pagamento, on=["forma_pagamento", "num_parcelas"], how="left")
    .merge(dim_tempo[["id_data", "data"]], on="data", how="left")
)

fato_vendas = fato_vendas[[
    "id_cliente",
    "id_produto",
    "id_pagamento",
    "id_data",
    "preco"   # ou valor_total, ajusta aqui conforme seu df
]]

In [35]:
fato_vendas.to_sql("fato_vendas", conn, if_exists="append", index=False)
conn.commit()

In [36]:
pd.read_sql('select * from fato_vendas', conn)

      id_venda  id_cliente  id_produto  id_pagamento   id_data    preco
0            1           1           1             1  20180925  R$ 1200
1            2           2           2             2  20181210   R$ 500
2            3           3           2             3  20181229   R$ 750
3            4           4           2             4  20180503  R$ 1000
4            5           5           2             5  20180103   R$ 500
...        ...         ...         ...           ...       ...      ...
4995      4996        4996           1            18  20180729   R$ 500
4996      4997        4997           1            26  20181117   R$ 750
4997      4998        4998           2            34  20180925   R$ 500
4998      4999        4999           2            27  20180124   R$ 500
4999      5000        5000           3            29  20180512   R$ 750

[5000 rows x 6 columns]